RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV10Z1287/include/MKV10Z1287.h
/* SOPT1 Bit Fields */
#define SIM_SOPT1_OSC32KSEL_MASK                 0xC0000u
#define SIM_SOPT1_OSC32KSEL_SHIFT                18
#define SIM_SOPT1_OSC32KSEL_WIDTH                2
#define SIM_SOPT1_OSC32KSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_SOPT1_OSC32KSEL_SHIFT))&SIM_SOPT1_OSC32KSEL_MASK)
/* SOPT2 Bit Fields */
#define SIM_SOPT2_CLKOUTSEL_MASK                 0xE0u
#define SIM_SOPT2_CLKOUTSEL_SHIFT                5
#define SIM_SOPT2_CLKOUTSEL_WIDTH                3
#define SIM_SOPT2_CLKOUTSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_CLKOUTSEL_SHIFT))&SIM_SOPT2_CLKOUTSEL_MASK)
#define SIM_SOPT2_FTMFFCLKSEL_MASK               0x3000000u
#define SIM_SOPT2_FTMFFCLKSEL_SHIFT              24
#define SIM_SOPT2_FTMFFCLKSEL_WIDTH              2
#define SIM_SOPT2_FTMFFCLKSEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT2_FTMFFCLKSEL_SHIFT))&SIM_SOPT2_FTMFFCLKSEL_MASK)
/* SOPT4 Bit Fields */
#define SIM_SOPT4_FTM0FLT0_MASK                  0x1u
#define SIM_SOPT4_FTM0FLT0_SHIFT                 0
#define SIM_SOPT4_FTM0FLT0_WIDTH                 1
#define SIM_SOPT4_FTM0FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0FLT0_SHIFT))&SIM_SOPT4_FTM0FLT0_MASK)
#define SIM_SOPT4_FTM0FLT1_MASK                  0x2u
#define SIM_SOPT4_FTM0FLT1_SHIFT                 1
#define SIM_SOPT4_FTM0FLT1_WIDTH                 1
#define SIM_SOPT4_FTM0FLT1(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0FLT1_SHIFT))&SIM_SOPT4_FTM0FLT1_MASK)
#define SIM_SOPT4_FTM1FLT0_MASK                  0x4u
#define SIM_SOPT4_FTM1FLT0_SHIFT                 2
#define SIM_SOPT4_FTM1FLT0_WIDTH                 1
#define SIM_SOPT4_FTM1FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1FLT0_SHIFT))&SIM_SOPT4_FTM1FLT0_MASK)
#define SIM_SOPT4_FTM2FLT0_MASK                  0x8u
#define SIM_SOPT4_FTM2FLT0_SHIFT                 3
#define SIM_SOPT4_FTM2FLT0_WIDTH                 1
#define SIM_SOPT4_FTM2FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2FLT0_SHIFT))&SIM_SOPT4_FTM2FLT0_MASK)
#define SIM_SOPT4_FTM0TRG0SRC_MASK               0x80u
#define SIM_SOPT4_FTM0TRG0SRC_SHIFT              7
#define SIM_SOPT4_FTM0TRG0SRC_WIDTH              1
#define SIM_SOPT4_FTM0TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0TRG0SRC_SHIFT))&SIM_SOPT4_FTM0TRG0SRC_MASK)
#define SIM_SOPT4_FTM0TRG1SRC_MASK               0x100u
#define SIM_SOPT4_FTM0TRG1SRC_SHIFT              8
#define SIM_SOPT4_FTM0TRG1SRC_WIDTH              1
#define SIM_SOPT4_FTM0TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0TRG1SRC_SHIFT))&SIM_SOPT4_FTM0TRG1SRC_MASK)
#define SIM_SOPT4_FTM0TRG2SRC_MASK               0x200u
#define SIM_SOPT4_FTM0TRG2SRC_SHIFT              9
#define SIM_SOPT4_FTM0TRG2SRC_WIDTH              1
#define SIM_SOPT4_FTM0TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0TRG2SRC_SHIFT))&SIM_SOPT4_FTM0TRG2SRC_MASK)
#define SIM_SOPT4_FTM1TRG0SRC_MASK               0x400u
#define SIM_SOPT4_FTM1TRG0SRC_SHIFT              10
#define SIM_SOPT4_FTM1TRG0SRC_WIDTH              1
#define SIM_SOPT4_FTM1TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1TRG0SRC_SHIFT))&SIM_SOPT4_FTM1TRG0SRC_MASK)
#define SIM_SOPT4_FTM1TRG1SRC_MASK               0x800u
#define SIM_SOPT4_FTM1TRG1SRC_SHIFT              11
#define SIM_SOPT4_FTM1TRG1SRC_WIDTH              1
#define SIM_SOPT4_FTM1TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1TRG1SRC_SHIFT))&SIM_SOPT4_FTM1TRG1SRC_MASK)
#define SIM_SOPT4_FTM1TRG2SRC_MASK               0x1000u
#define SIM_SOPT4_FTM1TRG2SRC_SHIFT              12
#define SIM_SOPT4_FTM1TRG2SRC_WIDTH              1
#define SIM_SOPT4_FTM1TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1TRG2SRC_SHIFT))&SIM_SOPT4_FTM1TRG2SRC_MASK)
#define SIM_SOPT4_FTM2TRG0SRC_MASK               0x2000u
#define SIM_SOPT4_FTM2TRG0SRC_SHIFT              13
#define SIM_SOPT4_FTM2TRG0SRC_WIDTH              1
#define SIM_SOPT4_FTM2TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2TRG0SRC_SHIFT))&SIM_SOPT4_FTM2TRG0SRC_MASK)
#define SIM_SOPT4_FTM2TRG1SRC_MASK               0x4000u
#define SIM_SOPT4_FTM2TRG1SRC_SHIFT              14
#define SIM_SOPT4_FTM2TRG1SRC_WIDTH              1
#define SIM_SOPT4_FTM2TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2TRG1SRC_SHIFT))&SIM_SOPT4_FTM2TRG1SRC_MASK)
#define SIM_SOPT4_FTM2TRG2SRC_MASK               0x8000u
#define SIM_SOPT4_FTM2TRG2SRC_SHIFT              15
#define SIM_SOPT4_FTM2TRG2SRC_WIDTH              1
#define SIM_SOPT4_FTM2TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2TRG2SRC_SHIFT))&SIM_SOPT4_FTM2TRG2SRC_MASK)
#define SIM_SOPT4_FTM1CH0SRC_MASK                0xC0000u
#define SIM_SOPT4_FTM1CH0SRC_SHIFT               18
#define SIM_SOPT4_FTM1CH0SRC_WIDTH               2
#define SIM_SOPT4_FTM1CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1CH0SRC_SHIFT))&SIM_SOPT4_FTM1CH0SRC_MASK)
#define SIM_SOPT4_FTM2CH0SRC_MASK                0x300000u
#define SIM_SOPT4_FTM2CH0SRC_SHIFT               20
#define SIM_SOPT4_FTM2CH0SRC_WIDTH               2
#define SIM_SOPT4_FTM2CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2CH0SRC_SHIFT))&SIM_SOPT4_FTM2CH0SRC_MASK)
#define SIM_SOPT4_FTM2CH1SRC_MASK                0x400000u
#define SIM_SOPT4_FTM2CH1SRC_SHIFT               22
#define SIM_SOPT4_FTM2CH1SRC_WIDTH               1
#define SIM_SOPT4_FTM2CH1SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2CH1SRC_SHIFT))&SIM_SOPT4_FTM2CH1SRC_MASK)
#define SIM_SOPT4_FTM0CLKSEL_MASK                0x3000000u
#define SIM_SOPT4_FTM0CLKSEL_SHIFT               24
#define SIM_SOPT4_FTM0CLKSEL_WIDTH               2
#define SIM_SOPT4_FTM0CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM0CLKSEL_SHIFT))&SIM_SOPT4_FTM0CLKSEL_MASK)
#define SIM_SOPT4_FTM1CLKSEL_MASK                0xC000000u
#define SIM_SOPT4_FTM1CLKSEL_SHIFT               26
#define SIM_SOPT4_FTM1CLKSEL_WIDTH               2
#define SIM_SOPT4_FTM1CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM1CLKSEL_SHIFT))&SIM_SOPT4_FTM1CLKSEL_MASK)
#define SIM_SOPT4_FTM2CLKSEL_MASK                0x30000000u
#define SIM_SOPT4_FTM2CLKSEL_SHIFT               28
#define SIM_SOPT4_FTM2CLKSEL_WIDTH               2
#define SIM_SOPT4_FTM2CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT4_FTM2CLKSEL_SHIFT))&SIM_SOPT4_FTM2CLKSEL_MASK)
/* SOPT5 Bit Fields */
#define SIM_SOPT5_UART0TXSRC_MASK                0x3u
#define SIM_SOPT5_UART0TXSRC_SHIFT               0
#define SIM_SOPT5_UART0TXSRC_WIDTH               2
#define SIM_SOPT5_UART0TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0TXSRC_SHIFT))&SIM_SOPT5_UART0TXSRC_MASK)
#define SIM_SOPT5_UART0RXSRC_MASK                0xCu
#define SIM_SOPT5_UART0RXSRC_SHIFT               2
#define SIM_SOPT5_UART0RXSRC_WIDTH               2
#define SIM_SOPT5_UART0RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0RXSRC_SHIFT))&SIM_SOPT5_UART0RXSRC_MASK)
#define SIM_SOPT5_UART1TXSRC_MASK                0x30u
#define SIM_SOPT5_UART1TXSRC_SHIFT               4
#define SIM_SOPT5_UART1TXSRC_WIDTH               2
#define SIM_SOPT5_UART1TXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1TXSRC_SHIFT))&SIM_SOPT5_UART1TXSRC_MASK)
#define SIM_SOPT5_UART1RXSRC_MASK                0xC0u
#define SIM_SOPT5_UART1RXSRC_SHIFT               6
#define SIM_SOPT5_UART1RXSRC_WIDTH               2
#define SIM_SOPT5_UART1RXSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1RXSRC_SHIFT))&SIM_SOPT5_UART1RXSRC_MASK)
#define SIM_SOPT5_UART0ODE_MASK                  0x10000u
#define SIM_SOPT5_UART0ODE_SHIFT                 16
#define SIM_SOPT5_UART0ODE_WIDTH                 1
#define SIM_SOPT5_UART0ODE(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART0ODE_SHIFT))&SIM_SOPT5_UART0ODE_MASK)
#define SIM_SOPT5_UART1ODE_MASK                  0x20000u
#define SIM_SOPT5_UART1ODE_SHIFT                 17
#define SIM_SOPT5_UART1ODE_WIDTH                 1
#define SIM_SOPT5_UART1ODE(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT5_UART1ODE_SHIFT))&SIM_SOPT5_UART1ODE_MASK)
/* SOPT6 Bit Fields */
#define SIM_SOPT6_FTM3FLT0_MASK                  0x1u
#define SIM_SOPT6_FTM3FLT0_SHIFT                 0
#define SIM_SOPT6_FTM3FLT0_WIDTH                 1
#define SIM_SOPT6_FTM3FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM3FLT0_SHIFT))&SIM_SOPT6_FTM3FLT0_MASK)
#define SIM_SOPT6_FTM4FLT0_MASK                  0x4u
#define SIM_SOPT6_FTM4FLT0_SHIFT                 2
#define SIM_SOPT6_FTM4FLT0_WIDTH                 1
#define SIM_SOPT6_FTM4FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4FLT0_SHIFT))&SIM_SOPT6_FTM4FLT0_MASK)
#define SIM_SOPT6_FTM5FLT0_MASK                  0x8u
#define SIM_SOPT6_FTM5FLT0_SHIFT                 3
#define SIM_SOPT6_FTM5FLT0_WIDTH                 1
#define SIM_SOPT6_FTM5FLT0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5FLT0_SHIFT))&SIM_SOPT6_FTM5FLT0_MASK)
#define SIM_SOPT6_FTM3TRG0SRC_MASK               0x80u
#define SIM_SOPT6_FTM3TRG0SRC_SHIFT              7
#define SIM_SOPT6_FTM3TRG0SRC_WIDTH              1
#define SIM_SOPT6_FTM3TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM3TRG0SRC_SHIFT))&SIM_SOPT6_FTM3TRG0SRC_MASK)
#define SIM_SOPT6_FTM3TRG1SRC_MASK               0x100u
#define SIM_SOPT6_FTM3TRG1SRC_SHIFT              8
#define SIM_SOPT6_FTM3TRG1SRC_WIDTH              1
#define SIM_SOPT6_FTM3TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM3TRG1SRC_SHIFT))&SIM_SOPT6_FTM3TRG1SRC_MASK)
#define SIM_SOPT6_FTM3TRG2SRC_MASK               0x200u
#define SIM_SOPT6_FTM3TRG2SRC_SHIFT              9
#define SIM_SOPT6_FTM3TRG2SRC_WIDTH              1
#define SIM_SOPT6_FTM3TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM3TRG2SRC_SHIFT))&SIM_SOPT6_FTM3TRG2SRC_MASK)
#define SIM_SOPT6_FTM4TRG0SRC_MASK               0x400u
#define SIM_SOPT6_FTM4TRG0SRC_SHIFT              10
#define SIM_SOPT6_FTM4TRG0SRC_WIDTH              1
#define SIM_SOPT6_FTM4TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4TRG0SRC_SHIFT))&SIM_SOPT6_FTM4TRG0SRC_MASK)
#define SIM_SOPT6_FTM4TRG1SRC_MASK               0x800u
#define SIM_SOPT6_FTM4TRG1SRC_SHIFT              11
#define SIM_SOPT6_FTM4TRG1SRC_WIDTH              1
#define SIM_SOPT6_FTM4TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4TRG1SRC_SHIFT))&SIM_SOPT6_FTM4TRG1SRC_MASK)
#define SIM_SOPT6_FTM4TRG2SRC_MASK               0x1000u
#define SIM_SOPT6_FTM4TRG2SRC_SHIFT              12
#define SIM_SOPT6_FTM4TRG2SRC_WIDTH              1
#define SIM_SOPT6_FTM4TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4TRG2SRC_SHIFT))&SIM_SOPT6_FTM4TRG2SRC_MASK)
#define SIM_SOPT6_FTM5TRG0SRC_MASK               0x2000u
#define SIM_SOPT6_FTM5TRG0SRC_SHIFT              13
#define SIM_SOPT6_FTM5TRG0SRC_WIDTH              1
#define SIM_SOPT6_FTM5TRG0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5TRG0SRC_SHIFT))&SIM_SOPT6_FTM5TRG0SRC_MASK)
#define SIM_SOPT6_FTM5TRG1SRC_MASK               0x4000u
#define SIM_SOPT6_FTM5TRG1SRC_SHIFT              14
#define SIM_SOPT6_FTM5TRG1SRC_WIDTH              1
#define SIM_SOPT6_FTM5TRG1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5TRG1SRC_SHIFT))&SIM_SOPT6_FTM5TRG1SRC_MASK)
#define SIM_SOPT6_FTM5TRG2SRC_MASK               0x8000u
#define SIM_SOPT6_FTM5TRG2SRC_SHIFT              15
#define SIM_SOPT6_FTM5TRG2SRC_WIDTH              1
#define SIM_SOPT6_FTM5TRG2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5TRG2SRC_SHIFT))&SIM_SOPT6_FTM5TRG2SRC_MASK)
#define SIM_SOPT6_FTM4CH0SRC_MASK                0xC0000u
#define SIM_SOPT6_FTM4CH0SRC_SHIFT               18
#define SIM_SOPT6_FTM4CH0SRC_WIDTH               2
#define SIM_SOPT6_FTM4CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4CH0SRC_SHIFT))&SIM_SOPT6_FTM4CH0SRC_MASK)
#define SIM_SOPT6_FTM5CH0SRC_MASK                0x300000u
#define SIM_SOPT6_FTM5CH0SRC_SHIFT               20
#define SIM_SOPT6_FTM5CH0SRC_WIDTH               2
#define SIM_SOPT6_FTM5CH0SRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5CH0SRC_SHIFT))&SIM_SOPT6_FTM5CH0SRC_MASK)
#define SIM_SOPT6_FTM3CLKSEL_MASK                0x3000000u
#define SIM_SOPT6_FTM3CLKSEL_SHIFT               24
#define SIM_SOPT6_FTM3CLKSEL_WIDTH               2
#define SIM_SOPT6_FTM3CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM3CLKSEL_SHIFT))&SIM_SOPT6_FTM3CLKSEL_MASK)
#define SIM_SOPT6_FTM4CLKSEL_MASK                0xC000000u
#define SIM_SOPT6_FTM4CLKSEL_SHIFT               26
#define SIM_SOPT6_FTM4CLKSEL_WIDTH               2
#define SIM_SOPT6_FTM4CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM4CLKSEL_SHIFT))&SIM_SOPT6_FTM4CLKSEL_MASK)
#define SIM_SOPT6_FTM5CLKSEL_MASK                0x30000000u
#define SIM_SOPT6_FTM5CLKSEL_SHIFT               28
#define SIM_SOPT6_FTM5CLKSEL_WIDTH               2
#define SIM_SOPT6_FTM5CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT6_FTM5CLKSEL_SHIFT))&SIM_SOPT6_FTM5CLKSEL_MASK)
/* SOPT7 Bit Fields */
#define SIM_SOPT7_ADC0TRGSEL_MASK                0xFu
#define SIM_SOPT7_ADC0TRGSEL_SHIFT               0
#define SIM_SOPT7_ADC0TRGSEL_WIDTH               4
#define SIM_SOPT7_ADC0TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0TRGSEL_SHIFT))&SIM_SOPT7_ADC0TRGSEL_MASK)
#define SIM_SOPT7_ADC0PRETRGSEL_MASK             0x10u
#define SIM_SOPT7_ADC0PRETRGSEL_SHIFT            4
#define SIM_SOPT7_ADC0PRETRGSEL_WIDTH            1
#define SIM_SOPT7_ADC0PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0PRETRGSEL_SHIFT))&SIM_SOPT7_ADC0PRETRGSEL_MASK)
#define SIM_SOPT7_ADC0ALTTRGEN_MASK              0xC0u
#define SIM_SOPT7_ADC0ALTTRGEN_SHIFT             6
#define SIM_SOPT7_ADC0ALTTRGEN_WIDTH             2
#define SIM_SOPT7_ADC0ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0ALTTRGEN_SHIFT))&SIM_SOPT7_ADC0ALTTRGEN_MASK)
#define SIM_SOPT7_ADC1TRGSEL_MASK                0xF00u
#define SIM_SOPT7_ADC1TRGSEL_SHIFT               8
#define SIM_SOPT7_ADC1TRGSEL_WIDTH               4
#define SIM_SOPT7_ADC1TRGSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1TRGSEL_SHIFT))&SIM_SOPT7_ADC1TRGSEL_MASK)
#define SIM_SOPT7_ADC1PRETRGSEL_MASK             0x1000u
#define SIM_SOPT7_ADC1PRETRGSEL_SHIFT            12
#define SIM_SOPT7_ADC1PRETRGSEL_WIDTH            1
#define SIM_SOPT7_ADC1PRETRGSEL(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1PRETRGSEL_SHIFT))&SIM_SOPT7_ADC1PRETRGSEL_MASK)
#define SIM_SOPT7_ADC1ALTTRGEN_MASK              0xC000u
#define SIM_SOPT7_ADC1ALTTRGEN_SHIFT             14
#define SIM_SOPT7_ADC1ALTTRGEN_WIDTH             2
#define SIM_SOPT7_ADC1ALTTRGEN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1ALTTRGEN_SHIFT))&SIM_SOPT7_ADC1ALTTRGEN_MASK)
#define SIM_SOPT7_ADC0ALTCLKSRC_MASK             0x3000000u
#define SIM_SOPT7_ADC0ALTCLKSRC_SHIFT            24
#define SIM_SOPT7_ADC0ALTCLKSRC_WIDTH            2
#define SIM_SOPT7_ADC0ALTCLKSRC(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC0ALTCLKSRC_SHIFT))&SIM_SOPT7_ADC0ALTCLKSRC_MASK)
#define SIM_SOPT7_ADC1ALTCLKSRC_MASK             0xC000000u
#define SIM_SOPT7_ADC1ALTCLKSRC_SHIFT            26
#define SIM_SOPT7_ADC1ALTCLKSRC_WIDTH            2
#define SIM_SOPT7_ADC1ALTCLKSRC(x)               (((uint32_t)(((uint32_t)(x))<<SIM_SOPT7_ADC1ALTCLKSRC_SHIFT))&SIM_SOPT7_ADC1ALTCLKSRC_MASK)
/* SOPT8 Bit Fields */
#define SIM_SOPT8_FTM0SYNCBIT_MASK               0x1u
#define SIM_SOPT8_FTM0SYNCBIT_SHIFT              0
#define SIM_SOPT8_FTM0SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM0SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0SYNCBIT_SHIFT))&SIM_SOPT8_FTM0SYNCBIT_MASK)
#define SIM_SOPT8_FTM1SYNCBIT_MASK               0x2u
#define SIM_SOPT8_FTM1SYNCBIT_SHIFT              1
#define SIM_SOPT8_FTM1SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM1SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM1SYNCBIT_SHIFT))&SIM_SOPT8_FTM1SYNCBIT_MASK)
#define SIM_SOPT8_FTM2SYNCBIT_MASK               0x4u
#define SIM_SOPT8_FTM2SYNCBIT_SHIFT              2
#define SIM_SOPT8_FTM2SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM2SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM2SYNCBIT_SHIFT))&SIM_SOPT8_FTM2SYNCBIT_MASK)
#define SIM_SOPT8_FTM3SYNCBIT_MASK               0x8u
#define SIM_SOPT8_FTM3SYNCBIT_SHIFT              3
#define SIM_SOPT8_FTM3SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM3SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM3SYNCBIT_SHIFT))&SIM_SOPT8_FTM3SYNCBIT_MASK)
#define SIM_SOPT8_FTM4SYNCBIT_MASK               0x10u
#define SIM_SOPT8_FTM4SYNCBIT_SHIFT              4
#define SIM_SOPT8_FTM4SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM4SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM4SYNCBIT_SHIFT))&SIM_SOPT8_FTM4SYNCBIT_MASK)
#define SIM_SOPT8_FTM5SYNCBIT_MASK               0x20u
#define SIM_SOPT8_FTM5SYNCBIT_SHIFT              5
#define SIM_SOPT8_FTM5SYNCBIT_WIDTH              1
#define SIM_SOPT8_FTM5SYNCBIT(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM5SYNCBIT_SHIFT))&SIM_SOPT8_FTM5SYNCBIT_MASK)
#define SIM_SOPT8_CARRIER_SELECT0_MASK           0x300u
#define SIM_SOPT8_CARRIER_SELECT0_SHIFT          8
#define SIM_SOPT8_CARRIER_SELECT0_WIDTH          2
#define SIM_SOPT8_CARRIER_SELECT0(x)             (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_CARRIER_SELECT0_SHIFT))&SIM_SOPT8_CARRIER_SELECT0_MASK)
#define SIM_SOPT8_FTM0OCH0SRC_MASK               0x10000u
#define SIM_SOPT8_FTM0OCH0SRC_SHIFT              16
#define SIM_SOPT8_FTM0OCH0SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH0SRC_SHIFT))&SIM_SOPT8_FTM0OCH0SRC_MASK)
#define SIM_SOPT8_FTM0OCH1SRC_MASK               0x20000u
#define SIM_SOPT8_FTM0OCH1SRC_SHIFT              17
#define SIM_SOPT8_FTM0OCH1SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH1SRC_SHIFT))&SIM_SOPT8_FTM0OCH1SRC_MASK)
#define SIM_SOPT8_FTM0OCH2SRC_MASK               0x40000u
#define SIM_SOPT8_FTM0OCH2SRC_SHIFT              18
#define SIM_SOPT8_FTM0OCH2SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH2SRC_SHIFT))&SIM_SOPT8_FTM0OCH2SRC_MASK)
#define SIM_SOPT8_FTM0OCH3SRC_MASK               0x80000u
#define SIM_SOPT8_FTM0OCH3SRC_SHIFT              19
#define SIM_SOPT8_FTM0OCH3SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH3SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH3SRC_SHIFT))&SIM_SOPT8_FTM0OCH3SRC_MASK)
#define SIM_SOPT8_FTM0OCH4SRC_MASK               0x100000u
#define SIM_SOPT8_FTM0OCH4SRC_SHIFT              20
#define SIM_SOPT8_FTM0OCH4SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH4SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH4SRC_SHIFT))&SIM_SOPT8_FTM0OCH4SRC_MASK)
#define SIM_SOPT8_FTM0OCH5SRC_MASK               0x200000u
#define SIM_SOPT8_FTM0OCH5SRC_SHIFT              21
#define SIM_SOPT8_FTM0OCH5SRC_WIDTH              1
#define SIM_SOPT8_FTM0OCH5SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM0OCH5SRC_SHIFT))&SIM_SOPT8_FTM0OCH5SRC_MASK)
#define SIM_SOPT8_FTM2OCH0SRC_MASK               0x400000u
#define SIM_SOPT8_FTM2OCH0SRC_SHIFT              22
#define SIM_SOPT8_FTM2OCH0SRC_WIDTH              1
#define SIM_SOPT8_FTM2OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM2OCH0SRC_SHIFT))&SIM_SOPT8_FTM2OCH0SRC_MASK)
#define SIM_SOPT8_FTM2OCH1SRC_MASK               0x800000u
#define SIM_SOPT8_FTM2OCH1SRC_SHIFT              23
#define SIM_SOPT8_FTM2OCH1SRC_WIDTH              1
#define SIM_SOPT8_FTM2OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT8_FTM2OCH1SRC_SHIFT))&SIM_SOPT8_FTM2OCH1SRC_MASK)
/* SOPT9 Bit Fields */
#define SIM_SOPT9_CARRIER_SELECT1_MASK           0x300u
#define SIM_SOPT9_CARRIER_SELECT1_SHIFT          8
#define SIM_SOPT9_CARRIER_SELECT1_WIDTH          2
#define SIM_SOPT9_CARRIER_SELECT1(x)             (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_CARRIER_SELECT1_SHIFT))&SIM_SOPT9_CARRIER_SELECT1_MASK)
#define SIM_SOPT9_FTM3OCH0SRC_MASK               0x10000u
#define SIM_SOPT9_FTM3OCH0SRC_SHIFT              16
#define SIM_SOPT9_FTM3OCH0SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH0SRC_SHIFT))&SIM_SOPT9_FTM3OCH0SRC_MASK)
#define SIM_SOPT9_FTM3OCH1SRC_MASK               0x20000u
#define SIM_SOPT9_FTM3OCH1SRC_SHIFT              17
#define SIM_SOPT9_FTM3OCH1SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH1SRC_SHIFT))&SIM_SOPT9_FTM3OCH1SRC_MASK)
#define SIM_SOPT9_FTM3OCH2SRC_MASK               0x40000u
#define SIM_SOPT9_FTM3OCH2SRC_SHIFT              18
#define SIM_SOPT9_FTM3OCH2SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH2SRC_SHIFT))&SIM_SOPT9_FTM3OCH2SRC_MASK)
#define SIM_SOPT9_FTM3OCH3SRC_MASK               0x80000u
#define SIM_SOPT9_FTM3OCH3SRC_SHIFT              19
#define SIM_SOPT9_FTM3OCH3SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH3SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH3SRC_SHIFT))&SIM_SOPT9_FTM3OCH3SRC_MASK)
#define SIM_SOPT9_FTM3OCH4SRC_MASK               0x100000u
#define SIM_SOPT9_FTM3OCH4SRC_SHIFT              20
#define SIM_SOPT9_FTM3OCH4SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH4SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH4SRC_SHIFT))&SIM_SOPT9_FTM3OCH4SRC_MASK)
#define SIM_SOPT9_FTM3OCH5SRC_MASK               0x200000u
#define SIM_SOPT9_FTM3OCH5SRC_SHIFT              21
#define SIM_SOPT9_FTM3OCH5SRC_WIDTH              1
#define SIM_SOPT9_FTM3OCH5SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM3OCH5SRC_SHIFT))&SIM_SOPT9_FTM3OCH5SRC_MASK)
#define SIM_SOPT9_FTM4OCH0SRC_MASK               0x400000u
#define SIM_SOPT9_FTM4OCH0SRC_SHIFT              22
#define SIM_SOPT9_FTM4OCH0SRC_WIDTH              1
#define SIM_SOPT9_FTM4OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM4OCH0SRC_SHIFT))&SIM_SOPT9_FTM4OCH0SRC_MASK)
#define SIM_SOPT9_FTM4OCH1SRC_MASK               0x800000u
#define SIM_SOPT9_FTM4OCH1SRC_SHIFT              23
#define SIM_SOPT9_FTM4OCH1SRC_WIDTH              1
#define SIM_SOPT9_FTM4OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_SOPT9_FTM4OCH1SRC_SHIFT))&SIM_SOPT9_FTM4OCH1SRC_MASK)
/* SDID Bit Fields */
#define SIM_SDID_PINID_MASK                      0xFu
#define SIM_SDID_PINID_SHIFT                     0
#define SIM_SDID_PINID_WIDTH                     4
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_PINID_SHIFT))&SIM_SDID_PINID_MASK)
#define SIM_SDID_DIEID_MASK                      0xF80u
#define SIM_SDID_DIEID_SHIFT                     7
#define SIM_SDID_DIEID_WIDTH                     5
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_DIEID_SHIFT))&SIM_SDID_DIEID_MASK)
#define SIM_SDID_REVID_MASK                      0xF000u
#define SIM_SDID_REVID_SHIFT                     12
#define SIM_SDID_REVID_WIDTH                     4
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SDID_REVID_SHIFT))&SIM_SDID_REVID_MASK)
#define SIM_SDID_SRAMSIZE_MASK                   0xF0000u
#define SIM_SDID_SRAMSIZE_SHIFT                  16
#define SIM_SDID_SRAMSIZE_WIDTH                  4
